      ******************************************************************
      * PROGRAMADOR: SILVANEI MARTINS
      * DATA: 02/03/2026
      * OBJETIVO: PROGRAMA PROG001A
      ******************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROG001A.
      *-----------------------------------------------------------------
       ENVIRONMENT DIVISION.
      *-----------------------------------------------------------------
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
      *-----------------------------------------------------------------
       PROCEDURE DIVISION.
       0001-PROCESSAR.
           DISPLAY "001-PROCESSAR"
           DISPLAY "SILVANEI"
                .
       0001-END.

       0002-PROCESSAR.
           DISPLAY "0002-PROCESSAR"
           DISPLAY "MARTINS"
           STOP RUN.
       0002-END.