       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLO.
       AUTHOR. SILVANEI MARTINS.

       ENVIRONMENT DIVISION.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-MENSAGEM    PIC X(30) VALUE 'SILVANEI MARTINS'.

       PROCEDURE DIVISION.
           DISPLAY WS-MENSAGEM.
           STOP RUN.
